app/controllers/feed_controller.rb

  def feed
    user_id = session[:user_id]
    unless user_id
      redirect_to login_login_path
      return
    end

    @posts = Post.all.order("created_at DESC")

    user = User.find(user_id)
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]