app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE ((email = NULL OR nickname = NULL) AND password = NULL) LIMIT ?  [["LIMIT", 1]]
---
  def post
    @user = User.find_by("(email = ? OR nickname = ?) AND password = ?", params["login"], params[:login], params["password"])