app/controllers/post_controller.rb

  def add
    user_id = session[:user_id]
    unless user_id
      redirect_to login_login_path
    end

    params[:creator_id] = user_id
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("message", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "asd"], ["creator_id", 2], ["created_at", "2020-05-31 19:27:55.652919"], ["updated_at", "2020-05-31 19:27:55.652919"]]