app/controllers/registration_controller.rb

  def register
    unless validate_params
      return
    end

    @user = User.create(post_params)
---
INSERT INTO "users" ("nickname", "description", "created_at", "updated_at", "password", "email") VALUES (?, ?, ?, ?, ?, ?)  [["nickname", "test"], ["description", "asdasd"], ["created_at", "2020-05-31 19:04:45.159974"], ["updated_at", "2020-05-31 19:04:45.159974"], ["password", "asd"], ["email", "asd@asd.com"]]